app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats"
---
    def index
      render json: Chat.all

SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      chat = Chat.find(params[:id])

INSERT INTO "chats" ("title", "description", "location", "age_group", "admin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        chat = Chat.create!(chat_params)

SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "chats" WHERE "chats"."id" = $1  [["id", 1]]
---
      def destroy
        chat = Chat.find(params[:id])
        chat.destroy