app/controllers/messages_controller.rb

    def create
        message = Message.create!(message_params)
        chat = Chat.find(message_params[:chat_id])
---
INSERT INTO "messages" ("content", "user_id", "chat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Test"], ["user_id", 4], ["chat_id", 1], ["created_at", "2021-07-29 18:21:24.706183"], ["updated_at", "2021-07-29 18:21:24.706183"]]
SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]